In [1]:
import numpy as np
import pandas as pd

In [2]:
stores_dict = {'manager' : ['Ali', 'Madhura', 'Victoria', 'Mary', 'Nina', 'Mia'],
              'city' : ['Toronto', 'Hamilton', 'Ottawa', 'Brampton', 'Kingston', 'Windsor'],
              'employees' : [26, 18, 20, 22, 16, 24]}

In [3]:
stores_dict

{'manager': ['Ali', 'Madhura', 'Victoria', 'Mary', 'Nina', 'Mia'],
 'city': ['Toronto', 'Hamilton', 'Ottawa', 'Brampton', 'Kingston', 'Windsor'],
 'employees': [26, 18, 20, 22, 16, 24]}

In [4]:
stores = pd.DataFrame(stores_dict)

In [5]:
stores

    manager      city  employees
0       Ali   Toronto         26
1   Madhura  Hamilton         18
2  Victoria    Ottawa         20
3      Mary  Brampton         22
4      Nina  Kingston         16
5       Mia   Windsor         24

In [98]:
stores.columns

Index(['manager', 'city', 'employees'], dtype='object')

In [99]:
type(stores.columns)

pandas.core.indexes.base.Index

In [100]:
stores.iloc[2]

manager      Victoria
city           Ottawa
employees          20
Name: 2, dtype: object

In [101]:
a = stores.iloc[1:3]

In [102]:
a

    manager      city  employees
1   Madhura  Hamilton         18
2  Victoria    Ottawa         20

In [103]:
stores.iloc[[0,1,3]]  #iloc only works with int, not str

   manager      city  employees
0      Ali   Toronto         26
1  Madhura  Hamilton         18
3     Mary  Brampton         22

In [104]:
stores.iloc[[1,3,4],1:3]  #The same as   stores.iloc[[1,3,4],[1,2]]

       city  employees
1  Hamilton         18
3  Brampton         22
4  Kingston         16

In [105]:
stores.iloc[:,[0,2]]

    manager  employees
0       Ali         26
1   Madhura         18
2  Victoria         20
3      Mary         22
4      Nina         16
5       Mia         24

In [106]:
stores.loc[[0,1,2],['manager','city']]  #loc works with heading(str)

    manager      city
0       Ali   Toronto
1   Madhura  Hamilton
2  Victoria    Ottawa

In [107]:
stores['city']

0     Toronto
1    Hamilton
2      Ottawa
3    Brampton
4    Kingston
5     Windsor
Name: city, dtype: object

In [108]:
type(stores['city'])

pandas.core.series.Series

In [109]:
stores.iloc[:,0:2]

    manager      city
0       Ali   Toronto
1   Madhura  Hamilton
2  Victoria    Ottawa
3      Mary  Brampton
4      Nina  Kingston
5       Mia   Windsor

In [110]:
stores.loc[:,['manager','city']]

    manager      city
0       Ali   Toronto
1   Madhura  Hamilton
2  Victoria    Ottawa
3      Mary  Brampton
4      Nina  Kingston
5       Mia   Windsor

In [111]:
stores[['manager','city']]

    manager      city
0       Ali   Toronto
1   Madhura  Hamilton
2  Victoria    Ottawa
3      Mary  Brampton
4      Nina  Kingston
5       Mia   Windsor

In [112]:
type(stores[['manager','city']])

pandas.core.frame.DataFrame

In [113]:
stores['revenue'] = [34, 28, 30, 26, 21, np.NaN]

In [114]:
stores

    manager      city  employees  revenue
0       Ali   Toronto         26     34.0
1   Madhura  Hamilton         18     28.0
2  Victoria    Ottawa         20     30.0
3      Mary  Brampton         22     26.0
4      Nina  Kingston         16     21.0
5       Mia   Windsor         24      NaN

In [115]:
stores['rev_emo'] = stores['revenue']/stores['employees']

In [116]:
stores

    manager      city  employees  revenue   rev_emo
0       Ali   Toronto         26     34.0  1.307692
1   Madhura  Hamilton         18     28.0  1.555556
2  Victoria    Ottawa         20     30.0  1.500000
3      Mary  Brampton         22     26.0  1.181818
4      Nina  Kingston         16     21.0  1.312500
5       Mia   Windsor         24      NaN       NaN

In [117]:
stores.drop(4, inplace = True)

In [118]:
stores

    manager      city  employees  revenue   rev_emo
0       Ali   Toronto         26     34.0  1.307692
1   Madhura  Hamilton         18     28.0  1.555556
2  Victoria    Ottawa         20     30.0  1.500000
3      Mary  Brampton         22     26.0  1.181818
5       Mia   Windsor         24      NaN       NaN

In [119]:
stores.drop('rev_emo', axis = 1, inplace = True)

In [120]:
stores

    manager      city  employees  revenue
0       Ali   Toronto         26     34.0
1   Madhura  Hamilton         18     28.0
2  Victoria    Ottawa         20     30.0
3      Mary  Brampton         22     26.0
5       Mia   Windsor         24      NaN

In [121]:
stores.index

Int64Index([0, 1, 2, 3, 5], dtype='int64')

In [122]:
stores.reset_index(inplace = True)

In [123]:
stores.index

RangeIndex(start=0, stop=5, step=1)

In [124]:
stores

   index   manager      city  employees  revenue
0      0       Ali   Toronto         26     34.0
1      1   Madhura  Hamilton         18     28.0
2      2  Victoria    Ottawa         20     30.0
3      3      Mary  Brampton         22     26.0
4      5       Mia   Windsor         24      NaN

In [125]:
stores['employees']<24

0    False
1     True
2     True
3     True
4    False
Name: employees, dtype: bool

In [126]:
stores[stores['employees']<24]

   index   manager      city  employees  revenue
1      1   Madhura  Hamilton         18     28.0
2      2  Victoria    Ottawa         20     30.0
3      3      Mary  Brampton         22     26.0

In [127]:
stores[(stores['employees']<24) & (stores['revenue']>=28)]

   index   manager      city  employees  revenue
1      1   Madhura  Hamilton         18     28.0
2      2  Victoria    Ottawa         20     30.0

In [128]:
stores[(stores['employees']<24) | (stores['revenue']>=28)]

   index   manager      city  employees  revenue
0      0       Ali   Toronto         26     34.0
1      1   Madhura  Hamilton         18     28.0
2      2  Victoria    Ottawa         20     30.0
3      3      Mary  Brampton         22     26.0

In [129]:
a = stores['revenue'].values  #turns to numpy array

In [130]:
type(a)

numpy.ndarray

In [131]:
stores.loc[4,'revenue'] = 18

In [132]:
stores

   index   manager      city  employees  revenue
0      0       Ali   Toronto         26     34.0
1      1   Madhura  Hamilton         18     28.0
2      2  Victoria    Ottawa         20     30.0
3      3      Mary  Brampton         22     26.0
4      5       Mia   Windsor         24     18.0

In [133]:
stores['manager'][0] = 'aaa'  #will have a warning but still change the value

<ipython-input-133-d4962f3005bf>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  stores['manager'][0] = 'aaa'

In [134]:
stores

   index   manager      city  employees  revenue
0      0       aaa   Toronto         26     34.0
1      1   Madhura  Hamilton         18     28.0
2      2  Victoria    Ottawa         20     30.0
3      3      Mary  Brampton         22     26.0
4      5       Mia   Windsor         24     18.0

In [136]:
stores

   index   manager      city  employees  revenue
0      0       aaa   Toronto         26     34.0
1      1   Madhura  Hamilton         18     28.0
2      2  Victoria    Ottawa         20     30.0
3      3      Mary  Brampton         22     26.0
4      5       Mia   Windsor         24     18.0

In [137]:
stores.min()  #Uppercase is preferred

index               0
manager       Madhura
city         Brampton
employees          18
revenue            18
dtype: object

In [139]:
stores.max()

index              5
manager          aaa
city         Windsor
employees         26
revenue           34
dtype: object

In [140]:
stores.mean()

index         2.2
employees    22.0
revenue      27.2
dtype: float64

In [6]:
stores['employees'].std()

3.7416573867739413

In [8]:
stores.describe()

       employees
count   6.000000
mean   21.000000
std     3.741657
min    16.000000
25%    18.500000
50%    21.000000
75%    23.500000
max    26.000000

In [11]:
stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   manager    6 non-null      object
 1   city       6 non-null      object
 2   employees  6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [12]:
stores['revenue'] = [34, 28, 30, 26, 21, np.NaN]

In [13]:
stores

    manager      city  employees  revenue
0       Ali   Toronto         26     34.0
1   Madhura  Hamilton         18     28.0
2  Victoria    Ottawa         20     30.0
3      Mary  Brampton         22     26.0
4      Nina  Kingston         16     21.0
5       Mia   Windsor         24      NaN

In [14]:
stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   manager    6 non-null      object
 1   city       6 non-null      object
 2   employees  6 non-null      int64
 3   revenue    5 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 320.0+ bytes

In [15]:
stores.corr()

           employees   revenue
employees   1.000000  0.814896
revenue     0.814896  1.000000

In [16]:
stores.loc[5,'revenue'] = 18

In [17]:
stores

    manager      city  employees  revenue
0       Ali   Toronto         26     34.0
1   Madhura  Hamilton         18     28.0
2  Victoria    Ottawa         20     30.0
3      Mary  Brampton         22     26.0
4      Nina  Kingston         16     21.0
5       Mia   Windsor         24     18.0

In [19]:
stores.corr()

           employees   revenue
employees   1.000000  0.281838
revenue     0.281838  1.000000

In [20]:
stores.cov()

           employees    revenue
employees       14.0   6.200000
revenue          6.2  34.566667

In [24]:
stores['revenue'].quantile(0.56)

27.599999999999998

In [79]:
data = pd.read_csv('tempo.csv')

In [80]:
data

     ID                    Name  Team Rank by Points   WIN%    PTS Location
0    MB         Milwaukee Bucks                    1  0.639  120.1      CEN
1    BN           Brooklyn Nets                    2  0.667  118.6      ATL
2    WW      Washington Wizards                    3  0.472  116.6      SOE
3    UJ               Utah Jazz                    4  0.722  116.4      NOR
4   PTB  Portland Trail Blazers                    5  0.583  116.1      NOR
5    IP          Indiana Pacers                    6  0.472  115.3      CEN
6    PS            Phoenix Suns                    7  0.708  115.3      PAC
7    DN          Denver Nuggets                    8  0.653  115.1      NOR
8   NOP    New Orleans Pelicans                    9  0.431  114.6      SOW
9    LC             LA Clippers                   10  0.653  114.0      PAC
10   SK        Sacramento Kings                   11  0.431  113.7      PAC
11  GSW   Golden State Warriors                   12  0.542  113.7      PAC
12   AH           Atlanta Hawks                   13  0.569  113.7      SOE
13  P76      Philadelphia 76ers                   14  0.681  113.6      ATL
14   MG       Memphis Grizzlies                   15  0.528  113.3      SOW
15   BC          Boston Celtics                   16  0.500  112.6      ATL
16   DM        Dallas Mavericks                   17  0.583  112.4      SOW
17   MT  Minnesota Timberwolves                   18  0.319  112.1      NOR
18   TR         Toronto Raptors                   19  0.375  111.3      ATL
19  SAS       San Antonio Spurs                   20  0.458  111.1      SOW
20   CB           Chicago Bulls                   21  0.431  110.7      CEN
21  LAL      Los Angeles Lakers                   22  0.583  109.5      PAC
22   CH       Charlotte Hornets                   23  0.458  109.5      SOE
23   HR         Houston Rockets                   24  0.236  108.8      SOW
24   MH              Miami Heat                   25  0.556  108.1      SOE
25  NYK         New York Knicks                   26  0.569  107.0      ATL
26   DP         Detroit Pistons                   27  0.278  106.6      CEN
27  OCT   Oklahoma City Thunder                   28  0.306  105.0      NOR
28   OM           Orlando Magic                   29  0.292  104.0      SOE
29   CC     Cleveland Cavaliers                   30  0.306  103.8      CEN

In [27]:
data2 = pd.read_csv('youtube.csv')

In [28]:
data2

,Unnamed: 0,X,video_id,views,likes,dislikes,comment_count,comments_disabled,ratings_disabled
0,4660,4660,a-4_6bThk2E,666861,16006,916,3686,False,False
1,16934,16934,5O6iNs0cEIU,239156,1598,252,327,False,False
2,26830,26830,RF-Mqs2qC-M,175490,9514,245,1070,False,False
3,8584,8584,YPR8K4TQ88M,1233755,8823,268,156,False,False
4,18050,18050,HQw0LJbwHY4,108850,730,46,67,False,False
...,...,...,...,...,...,...,...,...,...
995,24757,24757,wc27wBExdyw,108376,534,57,74,False,False
996,20943,20943,syAXXLxO8tw,910675,46643,791,1619,False,False
997,37469,37469,0kMYy9kU9jU,294246,22999,281,1194,False,False
998,15322,15322,VUYFDSs3Wlk,187172,923,28,44,False,False
999,20931,20931,HX8vJYcxQH4,677386,2688,165,277,False,False

In [29]:
data3 = pd.read_csv('youtube.csv', header = None)

In [30]:
data3

,0,1,2,3,4,5,6,7,8
0,NaN,X,video_id,views,likes,dislikes,comment_count,comments_disabled,ratings_disabled
1,4660.0,4660,a-4_6bThk2E,666861,16006,916,3686,False,False
2,16934.0,16934,5O6iNs0cEIU,239156,1598,252,327,False,False
3,26830.0,26830,RF-Mqs2qC-M,175490,9514,245,1070,False,False
4,8584.0,8584,YPR8K4TQ88M,1233755,8823,268,156,False,False
...,...,...,...,...,...,...,...,...,...
996,24757.0,24757,wc27wBExdyw,108376,534,57,74,False,False
997,20943.0,20943,syAXXLxO8tw,910675,46643,791,1619,False,False
998,37469.0,37469,0kMYy9kU9jU,294246,22999,281,1194,False,False
999,15322.0,15322,VUYFDSs3Wlk,187172,923,28,44,False,False
1000,20931.0,20931,HX8vJYcxQH4,677386,2688,165,277,False,False

In [31]:
data2.columns

Index(['Unnamed: 0', 'X', 'video_id', 'views', 'likes', 'dislikes',
       'comment_count', 'comments_disabled', 'ratings_disabled'],
      dtype='object')

In [64]:
data4 = pd.read_csv('youtube.csv', header = 0, names = ['c_1','c_2','','c_3','c_4','c_5','c_6','c_7','c_8'])

In [65]:
data4

       c_1    c_2                   c_3    c_4  c_5   c_6    c_7    c_8
0     4660   4660  a-4_6bThk2E   666861  16006  916  3686  False  False
1    16934  16934  5O6iNs0cEIU   239156   1598  252   327  False  False
2    26830  26830  RF-Mqs2qC-M   175490   9514  245  1070  False  False
3     8584   8584  YPR8K4TQ88M  1233755   8823  268   156  False  False
4    18050  18050  HQw0LJbwHY4   108850    730   46    67  False  False
..     ...    ...          ...      ...    ...  ...   ...    ...    ...
995  24757  24757  wc27wBExdyw   108376    534   57    74  False  False
996  20943  20943  syAXXLxO8tw   910675  46643  791  1619  False  False
997  37469  37469  0kMYy9kU9jU   294246  22999  281  1194  False  False
998  15322  15322  VUYFDSs3Wlk   187172    923   28    44  False  False
999  20931  20931  HX8vJYcxQH4   677386   2688  165   277  False  False

[1000 rows x 9 columns]

In [67]:
stores.to_csv('test1.csv',index = False)

In [87]:
data5 = pd.read_csv('test2.csv')

In [88]:
data5

  title_1  title_2  Unnamed: 2
0     123      456       789.0
1     aaa      bbb         NaN